RT-Thread/rt-thread/bsp/nxp/mcx/mcxc/Libraries/MCXC444/MCXC444/drivers/fsl_rtc.c
    /* RTC_SR */
    if (0U != (RTC_SR_TIF_MASK & base->SR))
    {
        tmp32 |= (uint32_t)kRTC_TimeInvalidFlag;
    }
    if (0U != (RTC_SR_TOF_MASK & base->SR))
    {
        tmp32 |= (uint32_t)kRTC_TimeOverflowFlag;
    }
    if (0U != (RTC_SR_TAF_MASK & base->SR))
    {
        tmp32 |= (uint32_t)kRTC_AlarmFlag;
    }
#if defined(FSL_FEATURE_RTC_HAS_MONOTONIC) && (FSL_FEATURE_RTC_HAS_MONOTONIC)
    if (0U != (RTC_SR_MOF_MASK & base->SR))
    {
        tmp32 |= (uint32_t)kRTC_MonotonicOverflowFlag;
    }
#endif /* FSL_FEATURE_RTC_HAS_MONOTONIC */
#if (defined(FSL_FEATURE_RTC_HAS_SR_TIDF) && FSL_FEATURE_RTC_HAS_SR_TIDF)
    /*
     * $Branch Coverage Justification$
     * (0U != (RTC_SR_TIDF_MASK & base->SR)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != (RTC_SR_TIDF_MASK & base->SR))
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        tmp32 |= (uint32_t)kRTC_TamperInterruptDetectFlag;
    }
#endif /* FSL_FEATURE_RTC_HAS_SR_TIDF */

#if (defined(FSL_FEATURE_RTC_HAS_TDR) && FSL_FEATURE_RTC_HAS_TDR)
    /* RTC_TDR */
    /*
     * $Branch Coverage Justification$
     * (0U != (RTC_TDR_TMF_MASK & base->TDR)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != (RTC_TDR_TMF_MASK & base->TDR))
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        tmp32 |= (uint32_t)kRTC_TestModeFlag;
    }
    if (0U != (RTC_TDR_FSF_MASK & base->TDR))
    {
        tmp32 |= (uint32_t)kRTC_FlashSecurityFlag;
    }
#if (defined(FSL_FEATURE_RTC_HAS_TDR_TPF) && FSL_FEATURE_RTC_HAS_TDR_TPF)
    /*
     * $Branch Coverage Justification$
     * (0U != (RTC_TDR_TPF_MASK & base->TDR)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != (RTC_TDR_TPF_MASK & base->TDR))
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        tmp32 |= (uint32_t)kRTC_TamperPinFlag;
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_TPF */
#if (defined(FSL_FEATURE_RTC_HAS_TDR_STF) && FSL_FEATURE_RTC_HAS_TDR_STF)
    /*
     * $Branch Coverage Justification$
     * (0U != (RTC_TDR_STF_MASK & base->TDR)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != (RTC_TDR_STF_MASK & base->TDR))
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        tmp32 |= (uint32_t)kRTC_SecurityTamperFlag;
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_STF */
#if (defined(FSL_FEATURE_RTC_HAS_TDR_LCTF) && FSL_FEATURE_RTC_HAS_TDR_LCTF)
    /*
     * $Branch Coverage Justification$
     * (0U != (RTC_TDR_LCTF_MASK & base->TDR)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != (RTC_TDR_LCTF_MASK & base->TDR))
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        tmp32 |= (uint32_t)kRTC_LossOfClockTamperFlag;
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_LCTF */
#endif /* FSL_FEATURE_RTC_HAS_TDR */

    return tmp32;
}

/*!
 * brief  Clears the RTC status flags.
 *
 * param base RTC peripheral base address
 * param mask The status flags to clear. This is a logical OR of members of the
 *             enumeration ::rtc_status_flags_t
 */
void RTC_ClearStatusFlags(RTC_Type *base, uint32_t mask)
{
    /* The alarm flag is cleared by writing to the TAR register */
    if (0U != (mask & (uint32_t)kRTC_AlarmFlag))
    {
        base->TAR = 0U;
    }

    /* The timer overflow flag is cleared by initializing the TSR register.
     * The time counter should be disabled for this write to be successful
     */
    if (0U != (mask & (uint32_t)kRTC_TimeOverflowFlag))
    {
        base->TSR = 1U;
    }

    /* The timer overflow flag is cleared by initializing the TSR register.
     * The time counter should be disabled for this write to be successful
     */
    if (0U != (mask & (uint32_t)kRTC_TimeInvalidFlag))
    {
        base->TSR = 1U;
    }

#if (defined(FSL_FEATURE_RTC_HAS_TDR) && FSL_FEATURE_RTC_HAS_TDR)
    /* To clear, write logic one to this flag after exiting from all test modes */
    /*
     * $Branch Coverage Justification$
     * (0U != ((uint32_t)kRTC_TestModeFlag & mask)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != ((uint32_t)kRTC_TestModeFlag & mask))
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        base->TDR = RTC_TDR_TMF_MASK;
    }
    /* To clear, write logic one to this flag after flash security is enabled */
    /*
     * $Branch Coverage Justification$
     * (0U != ((uint32_t)kRTC_FlashSecurityFlag & mask)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != ((uint32_t)kRTC_FlashSecurityFlag & mask))
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        base->TDR = RTC_TDR_FSF_MASK;
    }
#if (defined(FSL_FEATURE_RTC_HAS_TDR_TPF) && FSL_FEATURE_RTC_HAS_TDR_TPF)
    /* To clear, write logic one to the corresponding flag after that tamper pin negates */
    /*
     * $Branch Coverage Justification$
     * (0U != ((uint32_t)kRTC_TamperPinFlag & mask)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != ((uint32_t)kRTC_TamperPinFlag & mask))
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        base->TDR = RTC_TDR_TPF_MASK;
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_TPF */
#if (defined(FSL_FEATURE_RTC_HAS_TDR_STF) && FSL_FEATURE_RTC_HAS_TDR_STF)
    /* To clear, write logic one to this flag after security module has negated its tamper detect */
    /*
     * $Branch Coverage Justification$
     * (0U != ((uint32_t)kRTC_SecurityTamperFlag & mask)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != ((uint32_t)kRTC_SecurityTamperFlag & mask))
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        base->TDR = RTC_TDR_STF_MASK;
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_STF */
#if (defined(FSL_FEATURE_RTC_HAS_TDR_LCTF) && FSL_FEATURE_RTC_HAS_TDR_LCTF)
    /* To clear, write logic one to this flag after loss of clock negates */
    /*
     * $Branch Coverage Justification$
     * (0U != ((uint32_t)kRTC_LossOfClockTamperFlag & mask)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != ((uint32_t)kRTC_LossOfClockTamperFlag & mask))
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        base->TDR = RTC_TDR_LCTF_MASK;
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_LCTF */
#endif /* FSL_FEATURE_RTC_HAS_TDR */
}

#if defined(FSL_FEATURE_RTC_HAS_MONOTONIC) && (FSL_FEATURE_RTC_HAS_MONOTONIC)

/*!
 * brief Reads the values of the Monotonic Counter High and Monotonic Counter Low and returns
 *        them as a single value.
 *
 * param base    RTC peripheral base address
 * param counter Pointer to variable where the value is stored.
 */
void RTC_GetMonotonicCounter(RTC_Type *base, uint64_t *counter)
{
    uint64_t u64temp;

    assert(NULL != counter);

    u64temp  = (uint64_t)base->MCLR;
    *counter = (((uint64_t)base->MCHR << 32U) | u64temp);
}

/*!
 * brief Writes values Monotonic Counter High and Monotonic Counter Low by decomposing
 *        the given single value. The Monotonic Overflow Flag in RTC_SR is cleared due to the API.
 *
 * param base    RTC peripheral base address
 * param counter Counter value
 */
void RTC_SetMonotonicCounter(RTC_Type *base, uint64_t counter)
{
    /* Prepare to initialize the register with the new value written */
    base->MER &= ~RTC_MER_MCE_MASK;

    base->MCHR = (uint32_t)((counter) >> 32);
    base->MCLR = (uint32_t)(counter);
}

/*!
 * brief Increments the Monotonic Counter by one.
 *
 * Increments the Monotonic Counter (registers RTC_MCLR and RTC_MCHR accordingly) by setting
 * the monotonic counter enable (MER[MCE]) and then writing to the RTC_MCLR register. A write to the
 * monotonic counter low that causes it to overflow also increments the monotonic counter high.
 *
 * param base RTC peripheral base address
 *
 * return kStatus_Success: success
 *         kStatus_Fail: error occurred, either time invalid or monotonic overflow flag was found
 */
status_t RTC_IncrementMonotonicCounter(RTC_Type *base)
{
    if (0U != (base->SR & (RTC_SR_MOF_MASK | RTC_SR_TIF_MASK)))
    {
        return kStatus_Fail;
    }

    /* Prepare to switch to increment mode */
    base->MER |= RTC_MER_MCE_MASK;
    /* Write anything so the counter increments*/
    base->MCLR = 1U;

    return kStatus_Success;
}

#endif /* FSL_FEATURE_RTC_HAS_MONOTONIC */
